tutorials/Tjunction2D/0/fluidPhase_S2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      fluidPhase_S2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/inputParameters"

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    inletVessel
    {
        type         uniformFixedValue;
        uniformValue
        {
            type             scale;
            scale            linearRamp;
            start            $t0_chem;
            duration         $tf_chem;
            value            $S2_IC;
        }
    }
    
    outletVessel
    {
        type            zeroGradient;
    }

    outletExt
    {
        type            zeroGradient;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
    
    injuryWalls
    {
        type            zeroGradient;
    }
    

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
