tutorials/Tjunction2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U 
    {
        solver          GAMG;
        preconditioner  DILU;
        smoother        GaussSeidel;
        tolerance 1e-05;
        relTol 0.1;
    };

    // Mobile Platelets and ADP
    "(plt_Pmu|plt_Pma|ADP)"
    {
        solver          GAMG;
        preconditioner  DILU;
        smoother        GaussSeidel;
        tolerance 1e-05;
        relTol 0;
    }

    eta
    {
        solver          GAMG;
        preconditioner  DILU;
        smoother        GaussSeidel;
        tolerance 1e-05;
        relTol 0.1;
    };

    // Fluid Phase Chemeical Species
    "(fluidPhase_S1|fluidPhase_S2|fluidPhase_E1|fluidPhase_E2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
}

PISO
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
